app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "password_hash", "password_salt", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
  @user = User.new(params[:user])
  if @user.save